/**
  * Да се напише програма, която прочита символен низ от с дължина не-повече от 100 символа,
  * съставен от символите 0, 1 и *. Да се генерират и изведат на екрана всички символни низове,
  * получени от дадения, като всяко срещане на * е заменено по всички възможни начини с 0 или 1.
  * За генерирането да се използва рекурсивна функция.
  *
  * Пример: При вход 01*0* трябва да се получат низовете 01000 01001 01100 01101
  */

#include <iostream>

const int MAX_N = 100;

/// Генерира и принтира всички низове, които се получават чрез заместване на *
/// в низа `arr` от позиция `pos` до края.
void solve(char* arr, int pos);

int main() {
    char arr[MAX_N];
    std::cin >> arr;

    solve(arr, 0);
}

void solve(char* arr, int pos) {
    while (arr[pos] != '*' && arr[pos] != '\0') {
        pos++;
    }

    if (arr[pos] == '\0') {
        std::cout << arr << "\n";
        return;
    }

    arr[pos] = '0';
    solve(arr, pos + 1);

    arr[pos] = '1';
    solve(arr, pos + 1);

    arr[pos] = '*';
}
